backend/app/controllers/api/v1/movies_controller.rb

    def index
      movies = Movie.all
---
SELECT "movies".* FROM "movies"