backend/app/controllers/api/v1/reviews_controller.rb

    def create
        #binding.pry
        review = Review.new(review_params)
        if review.save
---
INSERT INTO "reviews" ("reviewer", "header", "body", "movie_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["reviewer", "Jessie"], ["header", "yo"], ["body", "badu"], ["movie_id", 1], ["created_at", "2021-02-20 08:33:19.006030"], ["updated_at", "2021-02-20 08:33:19.006030"]]

    def destroy
        @review = Review.find_by(id: params[:id]).destroy
---
DELETE FROM "reviews" WHERE "reviews"."id" = ?  [["id", 2]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]